app/controllers/movies_controller.rb

  def index
    @order = params[:order]      #obtains the order from the paramters sent from user input
    @all_ratings = Movie.pluck(:rating).uniq   #selects ratings and puts in an array ['P', 'PG', 'PG-13', 'R']


    if params[:ratings] == nil               #If first time to site
      @movies = Movie.order(params[:order])  #Orders the movies by the order sent in by user
      @checked = @all_ratings                #checks all boxes
    else
      @movies = Movie.where(rating: params[:ratings].keys).order(params[:order])   #Selects only the ratings the user gives
---
SELECT "movies"."rating" FROM "movies"
SELECT "movies".* FROM "movies" WHERE (rating = 'R','G')
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG-13', 'R') ORDER BY title

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "9"]]
UPDATE "movies" SET "rating" = 'G', "updated_at" = '2014-10-21 17:14:30.184164' WHERE "movies"."id" = 9